Updated the UI and updated app_v2.py
